// creating an array and passing the number, questions, options, and answers
let questions = [
  {
    numb: 1,
    question: "ชนิดของคำมีกี่ชนิด",
    answer: "7 ชนิด",
    options: [
    "5 ชนิด",
    "6 ชนิด",
    "7 ชนิด",
    "8 ชนิด"
    ]
  },
    {
    numb: 2,
    question: "เขาไปโรงเรียน คำว่า ”เขา” ในประโยคเป็นคำชนิดใด",
    answer: "คำสรรพนาม",
    options: [
      "คำสรรพนาม",
      "คำกริยา",
      "คำนาม",
      "คำวิเศษณ์"
    ]
  },
    {
    numb: 3,
    question: "ข้อความต่อไปนี้ข้อใดไม่มีคำนามปรากฏอยู่เลย",
    answer: "ฉันยังจำเธอได้",
    options: [
      "หมาวิ่งไล่แมว",
      "ฉันยังจำเธอได้",
      "นกตัวนี้เกาะบนกิ่งไม้",
      "การกระทำเป็นเครื่องส่อเจตนา"
    ]
  },
    {
    numb: 4,
    question: "พสกนิกรร่วมกิจกรรมจักรยานเฉลิมพระเกียรติปั่นเพื่อพ่อ Bike for Dad  คำว่าพสกนิกรเป็นคำนามชนิดใด",
    answer: "สามานยนาม",
    options: [
      "อาการนาม",
      "วิสามานยนาม",
      "ลักษณะนาม",
      "สามานยนาม"
    ]
  },
    {
    numb: 5,
    question: "ข้อใดทำหน้าที่สมุหนามได้ถูกต้อง",
    answer: "โขลง ช้างเดินที่ชายป่า",
    options: [
      "โขลง ช้างเดินที่ชายป่า",
      "ผึ้ง 1 ฝูง กำลังทำรัง",
      "นกนางนวล บินโฉบเฉี่ยวบนท้องฟ้า",
      "กรรมการ คณะนั้นกำลังตรวจบัญชี"
    ]
  },
  {
    numb: 6,
    question: "คำว่า “เขา” ในข้อใดเป็นสรรพนามบุรุษที่สาม",
    answer: "ฉันจะพูดให้เขาใจอ่อนเอง เธอรอหน่อยนะ",
    options: [
    "นกเขาตัวนั้นขันเสียงใส",
    "เราใช้มีดเขาควายคว้านมะพร้าวน้ำหอม",
    "ภูเขาลูกโน้นอยู่ในเขตอุทยานแห่งชาติเขาใหญ่",
    "ฉันจะพูดให้เขาใจอ่อนเอง เธอรอหน่อยนะ"
    ]
  },
  {
    numb: 7,
    question: "คำว่า ”ขน” ในข้อใดทำหน้าที่เป็นกิริยาของประโยค",
    answer: "เดโชใช้รถขนผักไปตลาด",
    options: [
    "คมศักดิ์ใช้ไม้ขนไก่ปัดฝุ่น",
    "เดโชใช้รถขนผักไปตลาด",
    "ลูกสุนัขขนขาวดูน่ารัก",
    "อัครเดชมีขนตางอนงาม"
    ]
  },
  {
    numb: 8,
    question: "คำใดต่อไปนี้เป็นลักษนาม",
    answer: "ตัว",
    options: [
      "ปลา",
      "ตัว",
      "แมว",
      "กิน"
    ]
  },
  {
    numb: 9,
    question: "ข้อใดมีสรรพนามบุรุษที่สาม",
    answer: "คุณครูท่านไม่อยู่",
    options: [
    "ฉันรักเธอ",
    "เธอต้องนั่งนิ่งๆ",
    "คุณครูท่านไม่อยู่",
    "หนูมาหาป้าหน่อยซิ"
    ]
  },
  {
    numb: 10,
    question: "คำ “ของ” ในข้อใดเป็นคำบุพบท",
    answer: "ฉันทัช เป็นนักกีฬาของโรงเรียน",
    options: [
    "กฤติน วางของเกลื่อนกลาดห้อง",
    "ฉันทัช เป็นนักกีฬาของโรงเรียน",
    "ธนกฤต ซื้อของขวัญปีใหม่ให้เธอ",
    "สุวิจักขณ์ อ่านหนังสือการ์ตูนอยู่ในห้องเก็บของ"
    ]
  },
  {
    numb: 11,
    question: "ข้อใดต่อไปนี้ต่างจากพวก",
    answer: "โรงเรียนวัดดอนเมือง",
    options: [
    "โรงภาพยนตร์",
    "โรงเรียนวัดดอนเมือง",
    "จังหวัด",
    "ประเทศ"
    ]
  },
  {
    numb: 12,
    question: "มีคำว่า การ หรือความ นำหน้า... คือลักษณะของคำประเภทใด",
    answer: "อาการนาม",
    options: [
    "วิกตรรถกริยา",
    "วิสามานยนาม",
    "อาการนาม",
    "ลักษณนาม"
    ]
  },
  {
    numb: 13,
    question: "ข้อใดต่อไปนี้ใช้ลักษณนามต่างจากข้ออื่น",
    answer: "กระดาษ",
    options: [
    "กรรไกร",
    "มีด",
    "หนังสือ",
    "กระดาษ"
    ]
  },
  {
    numb: 14,
    question: "ข้อใดต่อไปนี้ใช้คำสันธานไม่ถูกต้อง",
    answer: "เพราะเขาติวอย่างหนักและเขาสอบได้ที่หนึ่ง",
    options: [
    "ท้ังพ่อและแม่ไม่อยู่บ้าน",
    "เพราะแม่บ่นเขาจึงหนีไปนอน",
    "เพราะเขาติวอย่างหนักและเขาสอบได้ที่หนึ่ง",
    "เขากลัวผิวดำฉะนั้นจึงไม่อยากตากแดด"
    ]
  },
  {
    numb: 15,
    question: "”คำที่ใช้เรียกแทนบุคคลที่เป็นผู้พูด ผู้ฟัง และผู้ถูกกล่าวถึง” ข้อความข้างตนเป็นหน้าที่ของคำประเภทใด",
    answer: "บุรุษสรรพนาม",
    options: [
    "วิกตรรถกริยา",
    "บุรุษสรรพนาม",
    "ประพันธวิเศษณ์",
    "วิสามานยนาม"
    ]
  },
  {
    numb: 16,
    question: ".",
    answer: "..",
    options: [
    ".",
    "..",
    "...",
    "...."
    ]
  },
  {
    numb: 17,
    question: ".",
    answer: ".",
    options: [
    ".",
    "..",
    "..",
    "..."
    ]
  },
  {
    numb: 18,
    question: ".",
    answer: "...",
    options: [
    ".",
    "..",
    "...",
    "...."
    ]
  },
  {
    numb: 19,
    question: ".",
    answer: "..",
    options: [
    "..",
    "...",
    ".",
    "........"
    ]
  },
  {
    numb: 20,
    question: ".",
    answer: "....",
    options: [
    ".",
    "..",
    "...",
    "...."
    ]
  },
  
  // you can uncomment the below codes and make duplicate as more as you want to add question
  // but remember you need to give the numb value serialize like 1,2,3,5,6,7,8,9.....

  //   {
  //   numb: 6,
  //   question: "Your Question is Here",
  //   answer: "Correct answer of the question is here",
  //   options: [
  //     "Option 1",
  //     "option 2",
  //     "option 3",
  //     "option 4"
  //   ]
  // },
];
